Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: First we create the array we want to use, and then we pass that array to the script:
zh_cn: 首先创建将要使用的数组，然后传递给脚本：

source: First you have the Merge Tool section with the following fields:
zh_cn: 首先合并工具部分包含以下字段：

source: First you have the set of general options:
zh_cn: 有如下常规选项：

source: First, you should realise that surfaces (except the application surface) are "volatile".
zh_cn: 首先，应该认识到表面层（除了 应用表面层）是“不稳定的 ” are "volatile".

source: Fit Screen
zh_cn: 适应屏幕

source: Fixtures
zh_cn: 支架

source: Flags to be used when linking imported source files
zh_cn: 链接导入的源文件时将使用的标志（Flag）

source: Flags used when compiling imported source files
zh_cn: 编译导入的源文件时使用的标志（Flag）

source: Flare
zh_cn: 闪光

source: Flatten SubLayout
zh_cn: 展平子布局

source: Flick
zh_cn: 划过

source: Flip
zh_cn: 翻转

source: Flip (Y)
zh_cn: 翻转(Y)

source: Flip X:
zh_cn: 翻转 X:

source: Flip Y:
zh_cn: 翻转 Y:

source: Flip brush tool
zh_cn: 翻转笔刷工具

source: Flip the current brush along the Y axis
zh_cn: 将当前画刷沿Y轴翻转

source: Flip the path
zh_cn: 翻转改路径

source: Flip the tile
zh_cn: 翻转该图块

source: Flip the tile or brush
zh_cn: 翻转图块或画刷

source: Flip tiles
zh_cn: 翻转图块

source: Floating Dock
zh_cn: 浮动停靠栏

source: Floor
zh_cn: 向下取整(Floor)

source: Flurry Analytics ID
zh_cn: Flurry 分析 ID

source: Flurry Analytics Id
zh_cn: Flurry 分析 Id

source: Focused window next tab
zh_cn: 将窗口聚焦到下一标签

source: Focused window previous tab
zh_cn: 将窗口聚焦到上一标签

source: Fold All Regions
zh_cn: 折叠所有区域

source: Fold all open regions
zh_cn: 折叠所有的展开区域

source: Fold/Unfold region
zh_cn: 折叠/展开区域

source: Folded region
zh_cn: 拆叠区域

source: Folded region name
zh_cn: 折叠区域名称

source: Folder Name
zh_cn: 文件夹名称

source: Font
zh_cn: 字体

source: Font ""{0}"" packs more characters than can fit on the texture page.
zh_cn: 字体""{0}""包含的字符数超出纹理页面上可容纳的字符数。

source: Font AA
zh_cn: 字体抗锯齿（AA）

source: Font Adjustment
zh_cn: 字体调整

source: Font Manager: Default font '{0}' has not been loaded, text rendering will fail
zh_cn: 字体管理器：尚未加载默认字体“{0}”，文本呈现将失败

source: Font Name
zh_cn: 字体名称

source: Font Range
zh_cn: 字体范围

source: Font Style
zh_cn: 字体样式

source: Font family '{0}' is not available.
zh_cn: 字体系列 '{0}' 不可用。

source: Font not included in build
zh_cn: 构建版本中不包含字体

source: Font to use
zh_cn: 使用的字体

source: Font {0} font family {1} is installed but couldn't match style - Font has NOT been regenerated
zh_cn: 已安装字体{0}字体系列{1}但无法匹配样式 - 尚未重新生成字体

source: Font {0} has been converted to font family {1} ({2}) - Font has been regenerated, small inconsistencies may occur
zh_cn: 字体{0}已转换为字体系列{1}({2}) - 字体已重新生成，可能会出现小的不一致

source: Font {0} uses a font ({1}) not installed on this system - Font has NOT been regenerated
zh_cn: 创建的字体{0}使用未在此系统上安装的字体({1}) - 尚未重新生成字体

source: Font: {0}
zh_cn: 字体： {0}

source: Fonts
zh_cn: 字体

source: Fonts Label Colour
zh_cn: 字体标签颜色

source: Fonts background colour
zh_cn: 字体背景颜色

source: Fonts icon colour
zh_cn: 字体图标颜色

source: For 2D arrays you should be using the array_height_2d and array_length_2d functions.
zh_cn: 对于二维数组，你应该使用array_height_2d和array_length_2d函数。

source: For 8 and 4 it will report 12.
zh_cn: 对于 8 和 4 的支持它会输出12。

source: For Loop
zh_cn: 步长循环（For）

source: For all 3 levels (2,4 and 8) it will report 14.
zh_cn: 支持所有三个等级时 （2、4 和 8）将出输出14。

source: For an explanation of vectors and normalised vectors you can read the following two sections which give a brief overview of what is a vector and how it can be used in making games:
zh_cn: 为了解释一下向量和规范化向量，你可以阅读下面两个章节，提供了关于什么是向量以及在制作游戏过程中如何使用它们的一个简短的概述：

source: For each visible view, or, if no views are active, once
zh_cn: 为每个可见的视野执行一次下述序列，如果激活的视野，仅执行一次

source: For example if you have a script that takes two arguments and you only supply one then you will get an error for that script.
zh_cn: 比如你有一个脚本需要两个参数，而你只是提供了一个参数，这样就会报错。

source: For example many people use a prefix or a suffix to identify the differences between resources, like "obj_Ship" or "Ship_obj".
zh_cn: 例如，许多人使用前缀或后缀来识别资源之间的差异，如“obj_Ship”或“Ship_obj”。

source: For example, 217,361 is 110101000100010001 in binary.
zh_cn: 比如 217,361，二进制上是 110101000100010001。

source: For example, a layer with a depth of -300 will render over a layer with a depth of -100, and a layer with a depth of 1000 will render under everything with a depth less than this.
zh_cn: 例如，深度为 -300 的层将在深度为 -100 的层上呈现，深度为 1000 的层将呈现在深度小于此的所有层下。

source: For example, consider the following code:
zh_cn: 比如说，考虑如下代码：

source: For example, if you add a Key Press event you will then get a further window popping up with the sub events that allow you to select which key the object should respond to.
zh_cn: 例如，如果您添加一个按键事件，您将会再次弹出一个子事件，让您选择该对象应该响应的键。

source: For example, if you have 4 sprites all with the word "logo" somewhere in their name, like spr_Logo_One, then typing "logo" will show only those four sprites.
zh_cn: 例如，如果您有4个精灵，其名称中都有含有logo，如 spr_Logo_One，那么输入“logo”将只显示这四个精灵。

source: For example, if you have a 200 x 150 pixel window, and the player stretches the window by dragging the borders, the final window size may be 400 x 300 pixels, but the drawing canvas is STILL 200 x 150, which gives a blurred image as the pixel ratio is now 1:2.
zh_cn: 比如，你的窗口是 200 x 150 像素，玩家拖动边界拉伸窗口，最后窗口可能会是400 x 300 像素，但是绘制画布仍然是 200 x 150，因为像素缩放比例为1:2，图像变得模糊。

source: For example, if you have the resource tree window in focus then you will have an extra menu item here for "Resources".
zh_cn: 例如，如果焦点在资源树窗口，额外菜单项将出现“资源（Resource）”。

source: For example, let's say bit 1 is an "active" flag, and bit 3 is a "visible" flag.
zh_cn: 例如，我们假设 1 号位标记“活跃”，3 号位标记“可见”。

source: For example, let's say we want a counter that simply counts from 0 to 1 and back to 0 (toggling between 0 and 1), we could add one and do an IF to see if it's gotten to 2, and then reset it back to 1.
zh_cn: 例如，我们要一个计数器，简单的从 0 数到 1 然后回到 0（0 和 1之间切换），我们可以递增 1，使用“IF”检查是否获得 2，然后重新设置为 1。

source: For example, let's take the case above, but this time clear them.
zh_cn: 比如，还是上面的例子，这次是清除他们。

source: For example, maybe you are working on interactions between the player and several enemy objects, so you'd have the player on it's own workspace and the enemy objects in another, and perhaps another workspace only to show the scripts that both use.
zh_cn: 例如，也许你正在研究玩家和多个敌人之间的相互作用，所以你会有玩家在自己的工作区而敌人的物体在另一个，也许另一个工作区域只显示脚本或者两者都显示。

source: For example, say you have a platform game with multiple worlds - you could create a "World View" of the resource tree with folders called "World 1", "World 2", etc... and then drag the sprites, tilesets, instances and rooms associated with each world into the required folders.
zh_cn: 例如，假设您有一个具有多世界的平台游戏 - 您可以使用名为 “World 1”，“World 2” 等的文件夹创建资源树的 “World View”，然后拖动精灵，图块集， 与每个世界相关联的实例和房间到所需的文件夹。

source: For example, say you want to have an enemy create a number of instances when it dies, like some gold, an explosion and some blood as well as play a sound.
zh_cn: 例如，假设你想让一个敌人在死的时候创造一些实例，比如掉一些金子，产生爆炸或者流血效果，以及发出一些声音。

source: For example, the following 10 images form a sprite for a character who is waving his arms while skydiving.
zh_cn: 例如，以下10张图像就形成一个精灵，是一个跳伞时挥舞着双臂的角色。

source: For example, the following program creates five balls at random positions.
zh_cn: 比如说，下面的程序将会在随机位置创建5个球。

source: For example, you can use surfaces to "catch" instances, which can then be destroyed, and in this way you can create a decal effect where the sprite for the instance is displayed on the surface as if it still existed, permitting graphical effects like debris, blood, etc... without any real processing overhead.
zh_cn: 例如，您可以使用表面来“捕捉”实例，然后摧毁它，并以这种方式，在表面(surfaces)上，实例的精灵显示的位置，创建一个贴花效果，就好像它仍然存在一样，以此来制作一些图像效果，如碎片，血液等.. 这上面没有任何真实的处理进程。

source: For example, you may have a top down game where the main sprite has a rectangular collision mask, but to make collisions smoother a circular mask may be better.
zh_cn: 例如，你可能有一个自上而下的游戏，主要的精灵有一个矩形的碰撞掩模，但是使碰撞更平滑的圆形面具可能会更好。

source: For example, you may have two displays with the same resolution of 400 x 800, but display 1 has a dpi of 60 and display 2 has a dpi of 30.
zh_cn: 比如，你可能有两个显示器，它们有相同的分辨率400 x 800，但是显示器1是60dpi，而显示器2是30dpi。

source: For example:
zh_cn: 比如：

source: For examples of functions that return a pointer you can see buffer_get_address or sprite_get_texture.
zh_cn: 能够返回指针的函数典型例子有buffer_get_address或sprite_get_texture。

source: For expressions, the following operators exist (in order of priority):
zh_cn: 对于表达式，有下面这些运算符（以优先度排序）：

source: For full details of the possible issues and the changes made to GML, please see the Help Center article Porting A GMS 1.4 Project To GameMaker Studio 2, as well as the section of the manual on Obsolete Functions.
zh_cn: 对于可能出现的问题和GML所做的更新的所有细节，请参阅帮助中心文章 向GMS2导入一个GMS1.4项目（Porting A GMS 1.4 Project To GameMaker Studio 2），以及手册的弃用函数（Obsolete Functions）部分。

source: For full details, please see the following page:
zh_cn: 详情请见以下页面：

source: For further information on all the different events, please see here.
zh_cn: 有关所有类型事件的更多信息，请参阅 此处。

source: For further information on how to debug your game, please see the section of the manual on Debugging.
zh_cn: 有关如何调试游戏的详细信息，请参阅 调试 章节。

source: For further information see Surfaces.
zh_cn: 更多信息请查阅 表面层。

source: For information on creating your own tutorial projects, please see the section on the Marketplace (as all tutorials are created, hosted and downloaded from there.
zh_cn: 关于创建教程项目的信息，请参见 市场 章节（因为所有教程的创建、管理以及下载都来自于这里）

source: For information on how this works please see here.
zh_cn: 有关工作原理的信息，请看 这里。

source: For more details, as well as specific functions for this feature, please see the following section:
zh_cn: 更多具体的内容，以及一些特性函数，请查阅如下的章节：

source: For more information on Drag and Drop (DnD™) please see here.
zh_cn: 更多关于 Drag and Drop(DnD™)的详细信息请查看 这里.

source: For more information on arrays, please see: GML Overview - Arrays.
zh_cn: 关于数组的更多信息，参见GML概述 - 数组

source: For more information on debugging, please see the section Debugging.
zh_cn: 关于调试的更多信息，请查阅 调试 一节。

source: For more information on how to set up and use Remote Workers, please see the section below:
zh_cn: 有关如何设置和使用远程工作者的更多信息，请参阅以下部分：

source: For more information on runtime updates please see Preferences - Runtime Feeds.
zh_cn: 更多关于运行环境的更新请参阅偏好设置 - 运行环境引入

source: For more information on setting up see the section on Required SDKs or the helpdesk section on Console Targets.
zh_cn: 有关设置的详细信息，请参阅 所需 SDK 部分或 者 控制台平台 的知识库。

source: For more information on setting up see the section on Required SDKs or the helpdesk section on Mobile Targets.
zh_cn: 设置上的更多信息请查看 所需SDK 部分，或者 移动平台 的知识库部分。

source: For more information on setting up see the section on Required SDKs or the helpdesk section on UWP Targets.
zh_cn: 设置上的更多信息查看 所需SDK ，或者 UWP 平台 的知识库部分。

source: For more information on setting up see the section on Required SDKs.
zh_cn: 更多信息请参阅 必需的SDK。

source: For more information on setting up see the section on Required SDKs or the helpdesk section on the Amazon Fire licence.
zh_cn: 更多信息请参阅 必需的SDK 或 helpdesk 上关于 Amazon Fire 的许可。

source: For more information on the string functions see: GameMaker Language Reference - Strings.
zh_cn: 字符串函数的更多信息参见：GameMaker 语言参考 - 字符串

source: For more information on this and other number related functions, please see: GML Reference - Real Numbers.
zh_cn: 关于这个及其他与实数相关的函数参见GML参考 - 实数

source: For more information on this, please contact YoYo Games through the YoYo Games Education Portal.
zh_cn: 有关这方面的更多信息，请通过YoYo 教育门户联系YoYo游戏。

source: For more information on window position and window size, see window_set_position and window_set_size.
zh_cn: 更多关于窗口位置和大小的信息，查看 window_set_position 和window_set_size。

source: For more information see the page on Configurations.
zh_cn: 有关详细信息，请参阅 配置 页面。

source: For more information see the section on Required SDKs or the helpdesk section on Desktop Targets.
zh_cn: 更多信息请参阅章节 必须的SDK或在桌面目标平台的技术支持部分。

source: For more information, examples, tutorials, ideas and links to helpful forums and other great sites, check out the YoYo Games website:
zh_cn: 更多信息、 示例、 教程、 想法和帮助论坛和其他帮助网站的链接，请查阅 YoYo 游戏网站︰

source: For more information, see the section on the Game Options.
zh_cn: 有关更多信息，请参阅 游戏选项 部分。

source: For more section on the available resources please see the section on Editors.
zh_cn: 有关资源的更多内容，请参阅 编辑 部分。

source: For setup information see the helpdesk section on Required SDKs or the section on Desktop Targets.
zh_cn: 有关安装信息请参阅 必须的SDK 或 桌面目标平台。

source: For simple games you probably don't need to change anything here and can now go on to add Events to the object.
zh_cn: 对于简单的游戏来说，你可能不需要在这里改变一些属性。现在继续，添加一些 事件 到物体。

source: For specific details please see the relevant section here: GML Overview
zh_cn: 具体细节请参阅相关部分: GML概述

source: For such objects simply setting the density of the fixture to 0 will mean that the physics will assume that the object is intended to be static and it will not react at all to anything.
zh_cn: 对于这样的对象，简单地将夹具的密度设置为0将意味着物理学将假定该对象旨在是静态的，并且根本不会对任何内容产生反应。

source: For that we need the most important resource of GameMaker Studio 2, the Object resource.
zh_cn: 为此，我们需要创建 GameMaker Studio 2 最重要的资源，即 物体 资源。

source: For that you should use the function instance_exists.
zh_cn: 如欲那么做请使用函数instance_exists。

source: For that you would create one parent object and in that have all your behaviour actions or code in the required events, and then you would create your ten objects with no actions or code, but different sprites, and assign them your parent object.
zh_cn: 为此，您将创建一个父对象，并且在所需的事件中具有所有行为操作或代码，然后您将使用否操作或代码创建十个对象，但会创建不同的精灵，并分配他们是你的父对象。

source: For that, GameMaker Studio 2 has a special test mode called Debug Mode which will start the Debug Module, and there is also a comprehensive error reporting system which displays messages at run time to help you track down any problems with your game.
zh_cn: 对此，GameMaker Studio 2 提供了一个被称为 调试模式 的特殊测试模式，它将启动 调试模块 以及一个全面的错误报告系统，可在运行时显示信息，以帮助您跟踪游戏中出现的问题。

source: For the Windows platform you will need to have the following basic setup:
zh_cn: 对于 Windows 平台你至少需要以下配置：

source: For the Mac OS platform you will need to have at least the following minimum specs:
zh_cn: 对于MacsOS平台，您至少需要具备下述最低配置：

source: For the Mac OS you will need to have at least the following minimum specs:
zh_cn: 对于Mac OS你至少需要具有如下配置：

source: For the different compile options available when compiling please see the section on Compiling.
zh_cn: 编译时对于不同的可用的选项，请看 编译 章节。

source: For those that are new to the world of programming or who have never used any game creation tool before, GameMaker Studio 2 offers an intuitive and easy to use Drag and Drop (DnD™) interface of action icons that allow you to start creating your own games very quickly using visual scripting.
zh_cn: 对于那些编程世界的新手或者从没有使用过游戏创建工具的人， GameMaker Studio 2 提供了一个直观且易用的 Drag and Drop (DnD™) 动作界面图标，允使你使用虚拟的代码逻辑创建你自己的游戏。

source: For those types of things you should use Debug Mode (explained below).
zh_cn: 对于此类型情况你应该使用 调试模式（下一点即为该模式的详细解释）。

source: For up-to-date information and troubleshooting hints and tips related to the different target platforms, please see the YoYo Games Help Center.
zh_cn: 关于不同目标平台的最新信息和疑难解答提示，请参阅 YoYo 游戏帮助中心。

source: For your game to work you will need both of these to be uploaded to a server.
zh_cn: 要使您的游戏工作，您将需要将这两个文件 都 上传到服务器。

source: Force
zh_cn: 力

source: Force Software Vertex Processing
zh_cn: 强制使用软件的顶点处理(?)

source: Force expansion of all docks in the workspace
zh_cn: 强行展开工作区内所有停靠栏

source: Forces
zh_cn: 作用力

source: Fortunately there is an easy way of doing this by using the NOT operator.
zh_cn: 幸运的是的确还有简单的方法，那就是使用 “非（NOT）” 运算符。

source: Fortunately, you don't ever have to worry about this unless you want to add very large numbers together (like 2x128bit numbers).
zh_cn: 幸运的是，除非你想要将非常大的数字加在一起（比如2 x 128位数字），否则你不必担心这个问题。

source: Forward
zh_cn: 前进

source: Found
zh_cn: 已找到

source: Fourth, when drawing to a surface manually, the surface is always at the position of (0,0).
zh_cn: 第四，手动绘制表面层时，表面 始终 在 (0,0)的位置。

source: Fps Avg {0}
zh_cn: 平均帧率 {0}

source: Fps {0}
zh_cn: Fps(cpu steps) {0}

source: Fragment Shader: {0}
zh_cn: 片元着色器：{0}

source: Frame
zh_cn: 帧

source: Frame Count: {0}
zh_cn: 帧数：{0}

source: Frame Height
zh_cn: 单帧高度

source: Frame View
zh_cn: 帧视图

source: Frame Width
zh_cn: 单帧宽度

source: Frame:
zh_cn: 帧：

source: Frames
zh_cn: 帧

source: Frames back
zh_cn: 后方帧数

source: Frames forwards
zh_cn: 前方帧数

source: Frames per Row
zh_cn: 每行帧数

source: Frames per game frame
zh_cn: 每秒游戏帧数（game steps）

source: Frames per second
zh_cn: 每秒帧数（fps，cpu steps）

source: Free Data Structure
zh_cn: 释放数据结构

source: Free Target
zh_cn: 释放目标列表

source: Free an existing data structure.
zh_cn: 释放一个现有的数据结构。

source: Free rotate brush tool
zh_cn: 释放旋转笔刷工具

source: Friction
zh_cn: 阻力

source: Friction Joints
zh_cn: 阻力关节

source: Friction is the force that resists the relative motion of material elements sliding against each other, which in the GameMaker Studio 2 physics world, translates as the loss of momentum caused by the collision of two instances with fixtures bound to them.
zh_cn: 摩擦是抵抗物质元素彼此滑动的相对运动的力量，在GameMaker Studio 2物理世界中，由于两个实例与固定装置之间的撞击而造成的动量损失，这种力量将会转化为物理因素。

source: From Code
zh_cn: 从代码中获取

source: From File
zh_cn: 从文件中获取

source: Front Flip Content
zh_cn: 向前翻转的内容

source: Full Image
zh_cn: 全图

source: Full path on Mac to import framework from
zh_cn: Mac上导入框架的完整路径：

source: Full scale
zh_cn: 原图大小

source: Fullscreen
zh_cn: 全屏

source: Fullscreen workspace tab
zh_cn: 全屏工作区选项卡

source: Function
zh_cn: 函数

source: Function Call
zh_cn: 函数调用

source: Function Keys
zh_cn: 功能键

source: Functions
zh_cn: 函数

source: Functions / Macros:
zh_cn: 函数 / 宏：

source: Functions / Scripts / Arguments
zh_cn: 函数/脚本/参数

source: Functions:
zh_cn: 函数：

source: Further down you can also set more general styling for things like line selection of code brackets, etc...
zh_cn: 再进一步，您还可以为代码括号等的行选择设置更多一般的样式。

source: Further options are available for editing from the sub-categories listed below:
zh_cn: 下面列出的子目录中有更多可用于编辑的选项：

source: GCM Sender ID
zh_cn: GCM 发送者 ID

source: GCM Sender Id
zh_cn: GCM发件人Id

source: GML Overview
zh_cn: GML 概述

source: GML Reference
zh_cn: GML 参考

source: GML functions can support variable arguments
zh_cn: GML函数可以支持可变数量参数

source: GPU 'garlic' memory pool size (MB)
zh_cn: GPU 'garlic' 内存池大小（MB）

source: GUI Base
zh_cn: GUI Base 类(?)

source: Gadget
zh_cn: 部件

source: Gadget Layout Properties
zh_cn: 部件布局属性

source: Gadget Toolbox
zh_cn: 部件工具栏

source: Gadgets
zh_cn: 部件

source: Gadgets can't be parents.
zh_cn: 部件不能作为父级。

source: Game
zh_cn: 游戏

source: Game End
zh_cn: 游戏结束

source: Game Fps {0}
zh_cn: 游戏帧率(Game Fps) {0}

source: Game Frames Per Second
zh_cn: 每秒游戏帧数(FPS)

source: Game GUID
zh_cn: 游戏GUID

source: Game Identifier
zh_cn: 游戏标识号

source: Game Options
zh_cn: 游戏选项

source: Game Options - {0}
zh_cn: 游戏选项 - {0}

source: Game Start
zh_cn: 游戏开始

source: Game frames per second
zh_cn: 每秒游戏帧数(FPS)

source: Game speed set to {0}
zh_cn: 游戏速度设置为 {0}

source: GameMaker Community
zh_cn: GameMaker 社区

source: GameMaker Language
zh_cn: GameMaker 语言

source: GameMaker Language (GML)
zh_cn: GameMaker 语言（GML）

source: GameMaker Language Overview
zh_cn: GameMaker Language（GML）概览

source: GameMaker Studio 2 Certificate
zh_cn: GameMaker Studio 2 证书

source: GameMaker Studio 2 Layout
zh_cn: GameMaker Studio 2 布局

source: GameMaker Studio 2 Licences
zh_cn: GameMaker Studio 2 许可信息（License）

source: GameMaker Studio 2 Login Screen
zh_cn: GameMaker Studio 2 登录界面

source: GameMaker Studio 2 Manual
zh_cn: GameMaker Studio 2 手册

source: GameMaker Studio 2 Project
zh_cn: GameMaker Studio 2 项目

source: GameMaker Studio 2 Resource
zh_cn: GameMaker Studio 2 资源

# GameMaker Studio 2 has become unstable. Please save changes and exit.
source: GameMaker Studio 2 has become unstable.\nPlease save changes and exit.
zh_cn: GameMaker Studio 2 变得不稳定。\n请保存更改并退出。

source: GameMaker Studio 2 is designed for use on desktop computers with the following minimum specifications:
zh_cn: GameMaker Studio 2被设计用于具有如下最低配置的桌面计算机上：

source: Gamepad
zh_cn: 游戏手柄

source: Games are compiled using JavaScript.
zh_cn: 游戏使用 JavaScript 编译。

source: Games are compiled using the Android SDK and can be compiled using either the VM (a runner with interpreted code) or the YYC (YoYo Compiler which creates native code).
zh_cn: 游戏使用 Android SDK 编译，可以使用 VM (使用一个运行器来解释代码) 或者 YYC (YoYo Compiler 创建本地代码).

source: Gaussian
zh_cn: 高斯

source: General
zh_cn: 常规

source: General IDE
zh_cn: IDE全局

source: General Preferences
zh_cn: 常规偏好设置

source: General Settings
zh_cn: 常规设置

source: Generally this is used, as the name suggests, to generate a constant background fo rall the other layers in the room.
zh_cn: 一般来说，如名字所示，此层被用来为房间里的其他层产生一个不变的背景。

source: Generate
zh_cn: 生成

source: Generate Key Hash
zh_cn: 生成密钥哈希

source: Generate Keystore
zh_cn: 生成密钥库

source: Generate Map
zh_cn: 生成地图

source: Generate Map!
zh_cn: 生成地图！

source: Generate Patch
zh_cn: 生成补丁包

source: Generate Project Images
zh_cn: 生成项目图片

source: Generate Spotify App
zh_cn: 生成Spotify应用

source: Generate mipmaps
zh_cn: 生成多级渐进纹理（mipmap）

source: Generate mipmaps for separate texture pages
zh_cn: 为单独的纹理页生成多级渐进纹理（mipmap）

source: Generate mipmaps for seperate texture pages
zh_cn: 为单独的纹理页生成多级渐进纹理（mipmap）

source: Generating Events
zh_cn: 事件发生

source: Generation Mode
zh_cn: 生成模式

source: Genre
zh_cn: 类型（Genre）

source: Gesture
zh_cn: 手势

source: Get Alarm Countdown
zh_cn: 获取计时器的倒计时

source: Get Audio Length
zh_cn: 获取音频长度

source: Get Audio Pitch
zh_cn: 获取音频音调（Get Audio Pitch）

source: Get Audio Volume
zh_cn: 获取音频音量

source: Get Audio Volume Example
zh_cn: 获取音频音量举例

source: Get Audio Volume Syntax
zh_cn: 获取音频音量用法

source: Get Buffer Position
zh_cn: 获取缓冲区位置

source: Get Buffer Size
zh_cn: 获取缓冲区大小

source: Get Current Room
zh_cn: 获取当前房间

source: Get Draw Alpha
zh_cn: 获取绘制Alpha值

source: Get Draw Colour
zh_cn: 获取绘制颜色

source: Get Gamepad Axis
zh_cn: 获取手柄的轴向

source: Get Gamepad Connected
zh_cn: 获取已连接的游戏手柄

source: Get Gamepad Count
zh_cn: 获取游戏手柄数量

source: Get Gamepad Trigger
zh_cn: 获取手柄触发键

source: Get Global Variable
zh_cn: 获取全局变量

source: Get Grid Value
zh_cn: 获取栅格值

source: Get Health
zh_cn: 获取健值值

source: Get Index Of List Item
zh_cn: 获取列表项的索引

source: Get Instance Count
zh_cn: 获取实例数量

source: Get Instance Variable
zh_cn: 获取实例变量

source: Get List Item At
zh_cn: 获取所在处的列表项

source: Get List Item Count
zh_cn: 获取列表项总数

source: Get Lives
zh_cn: 获取生命数

source: Get Map Value
zh_cn: 获取映射值

source: Get Master Volume
zh_cn: 获取主音量

source: Get Path Follow Speed
zh_cn: 获取路径跟随的速度

source: Get Position Along Path
zh_cn: 获取沿着路径上的位置

source: Get Random Number
zh_cn: 获取一个随机数

source: Get Score
zh_cn: 获取得分

source: Get Tile At Pixel
zh_cn: 获取图块（像素）

source: Get Tile Data At Pixel
zh_cn: 获取像素位置的图块数据

source: Get Tile Data In Cell
zh_cn: 获取单元格内的图块数据

source: Get Tile Data Transform
zh_cn: 获取图块数据变换

source: Get Tile In Cell
zh_cn: 获取图块（网格单元）

source: Get Tile Index At Pixel
zh_cn: 获取像素位置的图块索引

source: Get Tile Index In Cell
zh_cn: 获取单元格的图块索引

source: Get Tilemap Variable
zh_cn: 获取图块地图变量

source: Get View Variable
zh_cn: 获取视野变量

source: Get Virtual Keyboard Height
zh_cn: 获取虚拟键盘高度

source: Get a global variable.
zh_cn: 获取一个全局变量。

source: Get a list item at an index.
zh_cn: 获取一个索引位置所在的列表项。

source: Get a random inclusive number.
zh_cn: 获取一个随机数（包括该数）。

source: Get a value in a grid.
zh_cn: 获取栅格结构中的值。

source: Get a variable from a tilemap element.
zh_cn: 从一个图块地图（tilemap）元素获取一个变量。

source: Get a variable pertaining to a room view.
zh_cn: 获取房间视野相关的变量。

source: Get current position in a buffer.
zh_cn: 获取缓冲区内的当前位置。

source: Get the alpha channel (0 to 1) used for drawing.
zh_cn: 获取绘制的透明度通道 (0 to 1) 。

source: Get the color used to blend all drawing with.
zh_cn: 获取用于绘制混合的颜色。

source: Get the colour used to blend all drawing with.
zh_cn: 获取用于混合所有绘图的颜色。

source: Get the countdown value of an alarm event.
zh_cn: 获取一个计时器事件的倒计时数。
